snlkuharlocal/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Брэнд</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТовара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Прайс</name>
    <type>
      <types>DocumentRef.ПрайсЛист</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ЖурналИзмененийЦен/ЖурналИзмененийЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналИзмененийЦен</name>
  <resources>
    <name>СтараяЦена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НоваяЦена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Брэнд</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЦенСкидок</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ТипУзлаИБ/ТипУзлаИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипУзлаИБ</name>
  <enumValues>
    <name>ИнтегральнаяИБ</name>
  </enumValues>
  <enumValues>
    <name>УправляющееПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>ТорговоеПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/InformationRegisters/ЦеныНоменклатуры/RecordSetModule.bsl
Функция ПолучитьИсходныеЦены()
	ДанныеВБазе=РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
	
	ДанныеВБазе.Отбор.Прайс.Установить(Отбор.Прайс.Значение);
	
	Если Отбор.ТипЦен.Значение<>Неопределено И НЕ Отбор.ТипЦен.Значение.Пустая() Тогда
		ДанныеВБазе.Отбор.ТипЦен.Установить(Отбор.ТипЦен.Значение);	
	КонецЕсли; 
	
	Если Отбор.Номенклатура.Значение<>Неопределено И НЕ Отбор.Номенклатура.Значение.Пустая() Тогда
		ДанныеВБазе.Отбор.Номенклатура.Установить(Отбор.Номенклатура.Значение);	
	КонецЕсли;
	
	Цены=Новый ТаблицаЗначений;
	Цены.Колонки.Добавить("ТипЦен");
	Цены.Колонки.Добавить("Номенклатура");
	Цены.Колонки.Добавить("Цена");
	
	ДанныеВБазе.Прочитать();
	Для Каждого Запись Из ДанныеВБазе Цикл
		СтрокаЦен=Цены.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЦен,Запись);		
	КонецЦикла;
	
	Возврат Цены;
КонецФункции // ПолучитьИсходныеЦены()

Процедура ЗаписатьВЖурналИзмененийЦен(Номенклатура,СтарыйТипЦен,НовыйТипЦен,СтараяЦена,НоваяЦена,ОбменДанными)	
	Если СтарыйТипЦен<>НовыйТипЦен И СтарыйТипЦен<>Неопределено Тогда
		Запись=РегистрыСведений.ЖурналИзмененийЦен.СоздатьМенеджерЗаписи();
		
		Запись.Дата				=ТекущаяДата();
		Запись.Номенклатура		=Номенклатура;
		Запись.Брэнд			=Номенклатура.Родитель;
		Запись.ТипЦенСкидок		=СтарыйТипЦен;
		Запись.СтараяЦена		=СтараяЦена;
		Запись.НоваяЦена		=0;
		Запись.Пользователь		=ПараметрыСеанса.Пользователь;
		Запись.УровеньДоступа	=СтарыйТипЦен.УровеньДоступа;
		
		Если ОбменДанными.Загрузка Тогда
			Запись.Отправитель		=ОбменДанными.Отправитель;		
			Запись.НомерСообщения	=ПараметрыСеанса.НомерСообщения;
		КонецЕсли;	
		
		Запись.Записать();
		
		СтараяЦена			   =0;
	КонецЕсли; 
	
	Запись=РегистрыСведений.ЖурналИзмененийЦен.СоздатьМенеджерЗаписи();
	
	Запись.Дата				=ТекущаяДата();
	Запись.Номенклатура		=Номенклатура;
	Запись.Брэнд			=Номенклатура.Родитель;
	Запись.ТипЦенСкидок		=НовыйТипЦен;
	Запись.СтараяЦена		=СтараяЦена;
	Запись.НоваяЦена		=НоваяЦена;
	Запись.Пользователь		=ПараметрыСеанса.Пользователь;
	Запись.УровеньДоступа	=НовыйТипЦен.УровеньДоступа;
	
	Если ОбменДанными.Загрузка Тогда
		Запись.Отправитель		=ОбменДанными.Отправитель;		
		Запись.НомерСообщения	=ПараметрыСеанса.НомерСообщения;
	КонецЕсли;	
	
	Запись.Записать();
КонецПроцедуры 

Процедура ПередЗаписью(Отказ, Замещение)	
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//Валетов+ 12.04.24
	Если Отбор.ТипЦен.Значение.ЦенаНаЭлементы И Отбор.Номенклатура.Значение.ЭтоГруппа Тогда
		Отказ = Истина;
		СообщитьИзМодуля("!!! Нельзя устанавливать цены на группы, для Типа цен с признаком Цена на элементы !!!");
		Возврат;
	КонецЕсли;
	//Валетов- 12.04.24
	Если НЕ ПараметрыСеанса.ОтключитьЖурнализациюЗаписи Тогда		
		ТипЦен		=Отбор.ТипЦен.Значение;	
		Если ТипЦен.Пустая() Тогда	
			ТипЦен  =Отбор.Прайс.Значение.ТипЦен;		
		КонецЕсли;
		
		ИсходныеЦены=ПолучитьИсходныеЦены();
		Для Каждого Запись Из ЭтотОбъект Цикл
			СтрИсходныхЦен=ИсходныеЦены.Найти(Запись.Номенклатура,"Номенклатура");
			
			ИсходнаяЦена	=?(СтрИсходныхЦен=Неопределено,0,СтрИсходныхЦен.Цена);		
			ИсходныйТипЦен	=?(СтрИсходныхЦен=Неопределено,Неопределено,СтрИсходныхЦен.ТипЦен);		
			
			Если ИсходнаяЦена<>Запись.Цена ИЛИ  ИсходныйТипЦен<>ТипЦен Тогда
				ЗаписатьВЖурналИзмененийЦен(Запись.Номенклатура,ИсходныйТипЦен,ТипЦен,ИсходнаяЦена,Запись.Цена,ОбменДанными);			
			КонецЕсли;		
			Если СтрИсходныхЦен<>Неопределено Тогда
				ИсходныеЦены.Удалить(СтрИсходныхЦен);		
			КонецЕсли;		
			Если Запись.УровеньДоступа<>Запись.ТипЦен.УровеньДоступа Тогда
				Запись.УровеньДоступа=Запись.ТипЦен.УровеньДоступа;		
			КонецЕсли; 
		КонецЦикла; 
		Для Каждого ИсходнаяЦена Из ИсходныеЦены Цикл
			ЗаписатьВЖурналИзмененийЦен(ИсходнаяЦена.Номенклатура,ИсходнаяЦена.ТипЦен,ТипЦен,ИсходнаяЦена.Цена,0,ОбменДанными);		
		КонецЦикла; 
	КонецЕсли;

	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;	
		
	Если ЗначениеЗаполнено(ТипЦен) И ТипЦен.Розничный И ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда	
		СписокПолучателейЦен=ПолучитьСписокПолучателейЦен(ТипЦен);
		Для Каждого Получатель Из СписокПолучателейЦен Цикл
			ОбменДанными.Получатели.Добавить(Получатель);
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры
